# handlers/create_vocab.py
MSG_ENTER_VOCAB_NAME = 'Введіть назву словника.'
MSG_ERROR_VOCAB_SAME_NAME = (
    'Нова назва словника не може бути такою ж, як і поточна.\n\n'
    'Введіть, будь-ласка, нову назву словника або натисніть на кнопку "Залишити поточну назву".')
MSG_SUCCESS_VOCAB_NAME_CREATED = (
    'Назва словника успішно збережена!\n\n'
    'Введіть примітку до словника')
MSG_SUCCESS_VOCAB_NOTE_CREATED = 'Примітка до словника успішно збережена!'
MSG_VOCAB_NAME_ERRORS = (
    'У назві словника "{vocab_name}" є помилки:\n'
    '{errors}')
MSG_VOCAB_NOTE_ERRORS = ('У примітці "{vocab_note}" до словника "{vocab_name}" є помилки:\n{errors}')
MSG_VOCAB_WORDPAIRS_SAVED_INSTRUCTIONS = ('Введіть "словникові пари" у форматі:\n'
                                          'w1 | tr1 , w2 | tr2 : t1, t2 : a\n\n'
                                          '- w — слово\n'
                                          '- tr — транскрипція (опціонально).\n'
                                          '- t — переклад.\n'
                                          '- a — анотація (опціонально).\n\n'
                                          '*Слово, переклад, анотація розділяються символом ":"\n'
                                          '*Слово та транскрипція розділяються символом "|"\n'
                                          '*Можна додати декілька слів чи перекладів, розділяючи їх символом "," (опціонально)\n\n'
                                          '(В одному повідомленні можна ввести декілька словникових пар розділених, кожну у новому рядку)')

MSG_ENTER_NEW_VOCAB_NAME = 'Введіть, будь-ласка, нову назву словника або натисніть на кнопку "Залишити поточну назву".'
MSG_ENTER_NEW_VOCAB_NAME = 'Введіть, будь-ласка, нову назву словника або натисніть на кнопку "Залишити поточну назву".'
MSG_CONFIRM_CANCEL_CREATE_VOCAB = 'Ви дійсно хочете скасувати створення словника?'
