# handlers/create_vocab.py
MSG_ENTER_VOCAB_NAME = 'Введіть назву словника.'
MSG_ENTER_NEW_VOCAB_NAME = 'Введіть, будь-ласка, нову назву словника або натисніть на кнопку "Залишити поточну назву".'
MSG_ENTER_VOCAB_DESCRIPTION = (
    'Назва словника успішно збережена!\n\n'
    'Введіть опис словника')
MSG_ENTER_WORDPAIRS = (
    'Опис словника був успішно збережений!\n\n'
    'Введіть "словникові пари" у форматі:\n'
    'w1 | tr1 , w2 | tr2 : t1, t2 : a\n\n'
    '- w — слово\n'
    '- tr — транскрипція (опціонально).\n'
    '- t — переклад.\n'
    '- a — анотація (опціонально).\n\n'
    '*Слово, переклад, анотація розділяються символом ":"\n'
    '*Слово та транскрипція розділяються символом "|"\n'
    '*Можна додати декілька слів чи перекладів, розділяючи їх символом "," (опціонально)\n\n'
    '(В одному повідомленні можна ввести декілька словникових пар розділених, кожну у новому рядку)')

MSG_ERROR_VOCAB_NAME_DUPLICATE = (
    'Нова назва словника не може бути такою ж, як і поточна.\n\n'
    'Введіть, будь-ласка, нову назву словника або натисніть на кнопку "Залишити поточну назву".')
MSG_ERROR_NO_VALID_WORDPAIRS = '⚠️ Немає валідних словникових пар.'
MSG_ERROR_NO_ADDED_WORDPAIRS = 'Немає доданих словникових пар.'
MSG_ERROR_VOCAB_NAME_IS_WRONG = (
  'У назві словника "{vocab_name}" є помилки:\n'
  '{errors}')
MSG_ERROR_VOCAB_DESCRIPTION_IS_WRONG = 'У примітці "{description}" до словника "{vocab_name}" є помилки:\n{errors}'

MSG_SUCCESS_VOCAB_SAVED_TO_DB: str = 'Словник "{vocab_name}" успішно збережено до бази словників!\n\n{menu}'
MSG_SUCCESS_ALL_WORDPAIRS_IS_VALID = '🎉 Немає помилок серед введених пар!'

MSG_INFO_ADDED_WORDPAIRS = '✅ Додані словникові пари:\n{wordpairs}'
MSG_INFO_NO_ADDED_WORDPAIRS = '❌ Не додані словникові пари:\n{wordpairs}'

MSG_CONFIRM_CANCEL_CREATE_VOCAB = 'Ви дійсно хочете скасувати створення словника?'


MSG_VOCAB_WORDPAIRS_SAVED_SMALL_INSTRUCTIONS = ('Введіть "словникові пари" у форматі:\n'
                                               'w1 | tr1 , w2 | tr2 : t1, t2 : a')





# handlers/menu.py
MSG_MENU = 'Головне меню'
MSG_MENU_FOR_NEW_USER = 'Привіт! 👋 Вітаємо у боті для вивчення слів!\n\nГоловне меню'


# handlers/vocab_base.py
MSG_ERROR_VOCAB_BASE_EMPTY = 'У вашій базі поки що немає словників.\nСтворіть новий словник, щоб почати.'
MSG_ENTER_VOCAB = 'Оберіть словник із вашої бази або створіть новий.'


# handlers/vocab_trainer.py
MSG_ENTER_VOCAB_FOR_TRAIN = 'Оберіть словник із вашої бази для початку тренування.'


# handlers/help.py
MSG_HELP = """
📚 Допомога: Як користуватися ботом для вивчення слів

1️⃣ Як додати новий словник

Кроки для створення словника:
1. Додати назву словника:
   Коли бот попросить ввести назву словника, введіть її в повідомленні. Назва має бути унікальною для вашого облікового запису.

2. Додати примітку до словника (опціонально):
   Якщо вам потрібна примітка (наприклад, тема словника або контекст його використання), ви можете додати її. Якщо примітка не потрібна, натисніть кнопку "Пропустити".

3. Додати словникові пари:
   Після створення словника вам потрібно додати слова та переклади. Словникові пари додаються у спеціальному форматі, який включає слова, транскрипції, переклади та анотації.

Формат словникових пар:
- Слово | транскрипція : переклад : анотація

Можна додавати декілька слів або перекладів через кому, але лише одну анотацію.

Приклади:
- слово | транскрипція : переклад (анотація необов'язкова)
  - cat | kæt : кіт
  - dog : пес

- слово | транскрипція : переклад, переклад2 : анотація
  - book | bʊk : книга, підручник : щось, що читають
  - sun : сонце : небесне тіло

Що означають поля:
- слово (обов’язкове): це слово, яке ви хочете додати до словника.
- транскрипція (опціонально): якщо ви хочете додати транскрипцію слова, вона пишеться після символу |.
- переклад (обов’язкове): переклад слова через двокрапку :.
- анотація (опціонально): додатковий опис або пояснення словникової пари, додається через двокрапку після перекладу.


2️⃣ Типи тренувань

Після того як ви створили словник та додали до нього слова, ви можете тренуватися. Існує два типи тренувань:

✅ Тренування на переклад:
Цей режим тренування допомагає вам вивчати переклади слів. Бот показує вам слово, і ваше завдання — ввести правильний переклад цього слова.

- Бот запитує слово з вашого словника, і ви маєте ввести відповідний переклад.
- Мета: перевірити, як добре ви пам’ятаєте переклад слів.

📝 Тренування на написання:
Цей режим допомагає вам практикуватися в написанні слів іноземною мовою. Бот показує переклад, а ви маєте правильно написати слово.

- Бот показує переклад, і вам потрібно ввести відповідне слово.
- Мета: перевірити, наскільки добре ви пам’ятаєте написання слів.


3️⃣ Додаткові можливості

- Перегляд бази словників: Ви можете переглядати всі свої словники та словникові пари через меню бази словників.
- Видалення або редагування: У разі помилок ви можете видаляти або редагувати словникові пари.

Цей бот допоможе вам ефективно вивчати нові слова, тренуватися на переклад або написання, а також підтримувати свої словники в порядку.
"""


# validators/vocab/vocab_name_validator.py
MSG_ERROR_UNIQUE_VOCAB_NAME = 'У вашій базі словників вже є словник з назвою "{name}".'
MSG_ERROR_LENGTH_VOCAB_NAME = 'Довжина назви словника має бути від {min_len} до {max_len} символів.'
MSG_ERROR_LENGTH_VOCAB_DESCRIPTION = 'Довжина опису словника має бути від {min_len} до {max_len} символів.'
MSG_ERROR_ALLOWED_CHARS_VOCAB_NAME = 'Назва словника може містити лише літери, цифри та символи: "{allowed_chars}".'
