# handlers/create_vocab.py
MSG_ENTER_VOCAB_NAME = 'Введіть назву словника:'
MSG_ENTER_NEW_VOCAB_NAME = 'Введіть нову назву словника або натисніть "Залишити поточну назву".'
MSG_ENTER_VOCAB_DESCRIPTION = 'Введіть опис словника або натисніть "Пропустити", якщо опис не потрібен.'
MSG_ENTER_WORDPAIRS = (
    '📝 Введіть "словникові пари" у форматі:\n'
    'w1 | tr1 , w2 | tr2 : t1, t2 : a\n\n'
    '- w — слово\n'
    '- tr — транскрипція (опціонально).\n'
    '- t — переклад.\n'
    '- a — анотація (опціонально).\n\n'
    '📌 Примітки:\n'
    '*Слово, переклад, анотація розділяються символом ":"\n'
    '*Слово та транскрипція розділяються символом "|"\n'
    '*Можна додати декілька слів чи перекладів, розділяючи їх символом "," (опціонально)\n\n'
    '(В одному повідомленні можна ввести декілька словникових пар, кожну у новому рядку)')
MSG_ENTER_WORDPAIRS_SMALL_INSTRUCTIONS = ('📝 Введіть словникові пари у форматі:\n'
                                          'w1 | tr1 , w2 | tr2 : t1, t2 : a\n')
MSG_ERROR_VOCAB_NAME_DUPLICATE = ('⚠️ Нова назва словника не може збігатися з поточною.\n\n'
                                  'Введіть нову назву або натисніть "Залишити поточну назву".')
MSG_ERROR_VOCAB_NAME_INVALID = ('⚠️ У назві словника "{name}" знайдено помилки:\n'
                                '{errors}')
MSG_ERROR_VOCAB_DESCRIPTION_INVALID = ('⚠️ У примітці "{description}" до словника "{name}" знайдено помилки:\n'
                                       '{errors}')
MSG_ERROR_WORDPAIRS_NO_VALID = '⚠️ Немає жодної валідної словникової пари.'
MSG_ERROR_NO_VALID_WORDPAIRS_ADDED = '❌ Не вдалося зберегти словник, оскільки немає валідних словникових пар.'
MSG_SUCCESS_VOCAB_SAVED_TO_DB = '✅ Словник "{name}" успішно збережено до бази словників!'
MSG_SUCCESS_ALL_WORDPAIRS_VALID = '🎉 Усі введені словникові пари валідні!'
MSG_INFO_ADDED_WORDPAIRS = ('✅ Додано словникові пари:\n'
                            '{wordpairs}')
MSG_INFO_NO_ADDED_WORDPAIRS = ('❌ Не додано словникові пари:\n'
                               '{wordpairs}')
MSG_CONFIRM_CANCEL_CREATE_VOCAB = '❓ Ви дійсно хочете скасувати створення словника?'


# handlers/menu.py
MSG_TITLE_MENU = '🏠 Головне меню'
MSG_TITLE_MENU_FOR_NEW_USER = ('👋 Привіт! Ласкаво просимо до бота для вивчення слів!\n\n'
                               '🏠 Головне меню')


# handlers/vocab_base.py
MSG_CHOOSE_VOCAB = ('📗 Оберіть словник із вашої бази для перегляду або редагування.\n'
                    '➕ Щоб створити новий словник, натисніть кнопку “Додати словник”.')
MSG_INFO_VOCAB_BASE_EMPTY = ('❗️ У вашій базі поки що немає словників.\n\n'
                              'Для створення словників, натисніть на кнопку "Додати словник".')
MSG_CONFIRM_DELETE_VOCAB = '❓ Ви дійсно хочете видалити словник "{name}"?'
MSG_SUCCESS_VOCAB_DELETED = '✅ Словник "{name}" успішно видалено з бази словників.'


# handlers/vocab_trainer.py
MSG_INFO_VOCAB_BASE_EMPTY_FOR_TRAINING = ('❗️ У вашій базі поки що немає словників.\n\n'
                                          'Створіть новий словник у розділі "База словників", щоб почати тренування.')
MSG_CHOOSE_VOCAB_FOR_TRAINING = '📗 Оберіть словник із вашої бази для початку тренування.'
MSG_CHOOSE_TRAINING_MODE = ('📗 Словник: {name}\n\n'
                            '🎯 Оберіть тип тренування, щоб продовжити.')
MSG_CONFIRM_CANCEL_TRAINING = ('❓ Ви дійсно хочете завершити тренування?\n'
                               'Усі результати будуть збережені.')
MSG_CORRECT_ANSWER = ('✅ Вірно!\n'
                      '{words} -> {translations}')
MSG_WRONG_ANSWER = ('❌ Неправильно!\n'
                    '"{words}" не перекладається як "{user_translation}"')
MSG_LEFT_ONE_WORD_TRAINING = '⚠️ Залишилось останнє слово. Пропускати більше не можна!'
MSG_SHOW_WORDPAIR_ANNOTATION = ('💡 Показ анотації\n\n'
                                '📝 Слово(а): {words}\n'
                                '📝 Анотація: {annotation}')
MSG_SHOW_WORDPAIR_TRANSLATION = ('💬 Показ перекладу\n\n'
                                 '📝 Слово(а): {words}\n'
                                 '📝 Переклад(и): {translations}\n'
                                 '📝 Анотація: {annotation}')


# handlers/help.py
MSG_TITLE_HELP = """
⁉️ Довідка: Як користуватися ботом «qx3learn-bot»

---

1️⃣ Створення нового словника
1. Перейдіть у розділ «База словників» і натисніть кнопку «Додати словник».

2. Введіть назву словника:
    - Назва має бути унікальною в межах вашого облікового запису.
    - Довжина: Від 3 до 50 символів.
    - Дозволені символи: літери, цифри, пробіли, тире (-), підкреслення (_).

3. Введіть опис словника (опціонально):
    - Опис може бути корисним для уточнення теми словника.
    - Довжина: Від 3 до 100 символів.
    - Якщо опис не потрібен, натисніть кнопку «Пропустити».

4. Додайте словникові пари:
    - Введіть хоча б одну словникову пару у наступному форматі:

слово | транскрипція, слово2 | транскрипція2 : переклад1, переклад2 : анотація

    - Мінімальна вимога: одне слово і один переклад.
    - Дозволені символи: літери, цифри, пробіли, тире (-), підкреслення (_).

5. Натисніть кнопку «Зберегти», щоб завершити створення словника.

---

2️⃣ Початок тренування
1. Перейдіть у розділ «Словниковий тренажер».

2. Оберіть словник з бази:
    - Бот відобразить список словників, які ви створили.
    - Якщо у вашій базі немає словників, спочатку потрібно створити їх у розділі «База словників».

3. Оберіть режим тренування:
    - 🎯 Прямий переклад (W -> T): Тренування перекладу від слова до перекладу.
    - 🎯 Зворотній переклад (T -> W): Тренування перекладу від перекладу до слова.

4. Розпочніть тренування:
    - Бот надасть вам слово для перекладу, і ви зможете:
        - Ввести відповідь.
        - Пропустити слово.
        - Запросити підказку, анотацію або дізнатися переклад.
        - Завершити тренування.

---

📖 Залишайтеся мотивованими та вдосконалюйте свої знання з qx3learn-bot! 💪
"""


# validators/vocab/vocab_name_validator.py
MSG_ERROR_VOCAB_NAME_UNIQUELY = 'У вашій базі вже є словник з назвою "{name}". Введіть іншу назву.'
MSG_ERROR_VOCAB_NAME_INVALID_LENGTH = 'Довжина назви словника має бути від {min_length} до {max_length} символів.'
MSG_ERROR_VOCAB_NAME_INVALID_CHARS = 'Назва словника може містити лише літери, цифри та символи: "{allowed_chars}".'


# validators/vocab/vocab_description_validator.py
MSG_ERROR_VOCAB_DESCRIPTION_INVALID_LENGTH = ('Довжина опису словника має бути від '
                                              '{min_length} до {max_length} символів.')


# validators/wordpair/wordpair_validator.py
MSG_ERROR_WORDPAIR_MIN_REQUIREMENT = ('Словникова пара повинна містити хоча б одне слово та один переклад, '
                                      'розділені символом "{separator}".')
MSG_ERROR_WORDPAIR_MAX_REQUIREMENT = 'Словникова пара може містити максимум три частини: слово, переклад і анотацію.'


# validators/wordpair/component_validator.py
MSG_ERROR_COMPONENT_INVALID_LENGTH = ('Довжина компонента "{component}" має бути від '
                                      '{min_length} до {max_length} символів.')
MSG_ERROR_COMPONENT_INVALID_CHARS = ('Компонент "{component}" може містити лише '
                                     'літери, цифри та символи: "{allowed_chars}".')
